app/controllers/nivels_controller.rb

  def index
    @nivels = Nivel.all
---
SELECT * FROM "nivels"