app/controllers/problemas_controller.rb

SELECT * FROM "problemas"
---
  def index
    @problemas = Problema.all

SELECT * FROM "problemas" WHERE ("problemas"."id" = 1)
---
  def show
    @problema = Problema.find(params[:id])

SELECT * FROM "problemas" WHERE ("problemas"."id" = 1)
---
  def edit
    @problema = Problema.find(params[:id])

INSERT INTO "problemas" ("id_no_pku", "categorias_old", "created_at", "nome", "updated_at", "origem_old", "link") VALUES(0, 0, '2009-06-08 21:32:59', 'nome 1', '2009-06-08 21:32:59', 0, 'link 1')
---
  def create
    @problema = Problema.new(params[:problema])

    respond_to do |format|
      if @problema.save

SELECT * FROM "problemas" WHERE ("problemas"."id" = 3)
DELETE FROM "problemas" WHERE "id" = 3
---
  def destroy
    @problema = Problema.find(params[:id])
    @problema.destroy